<template>
    <div class="show_block">
        <div class="content_block helpPage">
            <b>Добавление категорий.</b><br><br>
            - Чтобы добавить первый товар, создайте категории товаров, материалы и цвета
            через соответствующие пункты меню в главном меню.
            Категории можно редактировать, удалять, добавлять новые
            (через наведение мыши или клик по иконке меню
            <span class="helpPage__context_menu_icon1">&#8942;</span> на каждой категории).
            <br><br><br>
            <b>Добавление товаров.</b><br><br>
            - Добавьте товары через пункт меню «Добавить товар» в главном меню.
            Добавленные товары можно редактировать, удалять, добавлять в них новые фото
            (через наведение мыши или клик по иконке меню
            <span class="helpPage__context_menu_icon2">&#8942;</span> на каждом товаре).
            <br><br><br>
            <b>Удаленные товары.</b><br><br>
            - Удаленные товары попадают в раздел «Удаленные товары» доступный через соответствующий пункт меню
            в главном меню, в этом разделе удаленный товар можно восстановить, или удалить безвозвратно.
            Восстановить товар - то есть вернуть его в действующие товары, которые видно на сайте для
            всех пользователей.
            <br><br><br>
            <b>Добавление и изменение фото в товарах.</b><br><br>
            - Через иконку <span class="helpPage__context_menu_icon2">&#8942;</span> на каждом товаре
            можно перейти в фото-менеджер, где можно добавить новые фото товара, отредактировать фото
            (повернуть фото), или удалить фото.
            <br><br><br>
            <b>Перемещение мышью категорий и товаров.</b><br><br>
            - Категории и товары на сайте по умолчанию располагаются в том порядке, в каком они находятся
            в вашем разделе администратора. Поменять порядок можно мышью, кликнув левую кнопку мыши
            на нужной категории или товаре и перетащив категорию или товар в нужную позицию.
            Режим перетаскивания доступен в момент когда курсор мыши обретает вид
            <span class="helpPage__cursor_move__span">четырехсторонней стрелки</span>.
            Перетаскивание товаров удобнее в режиме мелких элементов, доступном по значку
            <img :src="smallViewingIcon" alt="" class="smallViewingIcon">.
            <br><br><br>
            <b>Перемещение фото в отдельном товаре.</b><br><br>
            - Поменять порядок расположения фото в каждом отдельном товаре можно мышью в фото-менеджере,
            кликнув левую кнопку мыши на нужном фото и перетащив фото в нужную позицию.
            Режим перетаскивания доступен в момент когда курсор мыши обретает вид
            <span class="helpPage__cursor_move__span">четырехсторонней стрелки</span>.
            <br><br><br>
            <b>SEO.</b><br><br>
            - У каждой категории и товара, а также у каждого отдельного фото можно добавить
            title и description их отдельной веб-страницы через пункт контекстного меню с названием SEO.
            (Создавать title и description страниц необязательно,
            они будут назначены сайтом автоматически, применяя принципы SEO).
            <br><br><br>
            <b>Пользователи.</b><br><br>
            - Вы сможете видеть зарегистрированных на вашем сайте пользователей
            через пункт меню «Пользователи» в главном меню, редактировать их настройки или удалять
            (через наведение мыши или клик по иконке меню
            <span class="helpPage__context_menu_icon1">&#8942;</span> на каждом пользователе).
            Также можно создать пользователя через пункт «Создать пользователя» в главном меню,
            если это потребуется. Все что касается действий с пользователями, нужно понимать что вы делаете.
        </div>
    </div>
</template>

<script>
import smallViewingIcon from "./../../../assets/roundViewSmallItemsIcon.svg"
export default {
    name: "HelpPage",
    data() {
        return {
            smallViewingIcon: smallViewingIcon,
        };
    },
}
</script>

<style scoped>
    .smallViewingIcon {
        width: 20px;
        margin-bottom: -5px;
    }
</style>
